lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising. */
static void advertising_start(void * p_erase_bonds)
{
    bool erase_bonds = *(bool*)p_erase_bonds;

    if (erase_bonds)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}

static void twi_config(void)
{
    uint32_t err_code;
    
    nrf_drv_twi_config_t const config={
      .scl=TCS34725_SCL_PIN,
      .sda=TCS34725_SDA_PIN,
      .frequency=NRF_TWI_FREQ_400K,
      .interrupt_priority=APP_IRQ_PRIORITY_MID,
      };
    
    err_code=nrf_twi_mngr_init(&m_nrf_twi_mngr,&config);
    APP_ERROR_CHECK(err_code);
}




/*@Callback
 */
void tcs34725_read_reg_cb(ret_code_t result, tcs34725_reg_data_t * p_raw_data)
{
    if(result!=NRF_SUCCESS)
    {
        NRF_LOG_INFO("TCS34725 register read fail");
        return;
    }
    p_raw_data->reg_addr&=0x1F;

    switch(p_raw_data->reg_addr)
    {
        case TCS34725_REG_ENABLE :
            NRF_LOG_INFO("Enable register : %X",p_raw_data->reg_data);
            break;
        case TCS34725_REG_TIMING :
            NRF_LOG_INFO("Timing register : %X",p_raw_data->reg_data);
            break;
        case TCS34725_REG_WAIT_TIME :
            NRF_LOG_INFO("Wait time register : %X",p_raw_data->reg_data);
            break;
        case TCS34725_REG_PERSISTENCE :
            NRF_LOG_INFO("Persistence register : %X",p_raw_data->reg_data);
            break;
        case TCS34725_REG_CONFIG :
            NRF_LOG_INFO("Configuration register : %X",p_raw_data->reg_data);
            break;
        case TCS34725_REG_CONTROL :
            NRF_LOG_INFO("Control register : %X",p_raw_data->reg_data);
            break;
        case TCS34725_REG_ID :
            NRF_LOG_INFO("ID register : %X",p_raw_data->reg_data);
            break;
        case TCS34725_REG_STATUS :
            NRF_LOG_INFO("Status register : %X",p_raw_data->reg_data);
            break;
        default :
            break;
    }
}

void tcs34725_rgbc_cb(ret_code_t result, tcs34725_rgbc_data_t * p_raw_data)
{
    if(result!=NRF_SUCCESS)
    {
        NRF_LOG_INFO("tcs rgbc callback failed");
        return;
    }
    tcs34725_rgbc_print(p_raw_data);

    tcs34725_rgbc_str.red=(int)((double)p_raw_data->red/p_raw_data->clear*255);
    tcs34725_rgbc_str.green=(int)((double)p_raw_data->green/p_raw_data->clear*255);
    tcs34725_rgbc_str.blue=(int)((double)p_raw_data->blue/p_raw_data->clear*255);

    printf("clear : %d, red : %d, blue : %d, green : %d\r\n",
            p_raw_data->clear,p_raw_data->red,p_raw_data->green,p_raw_data->blue);

//    xTaskNotify(m_ble_tcs_rgbc_send_thread, p_raw_data, eSetValueWithOverwrite);
    xTaskNotifyGive(m_ble_tcs_rgbc_send_thread);
}

void tcs34725_read_thr_cb(ret_code_t result, tcs34725_threshold_data_t * p_reg_data)
{
    if(result!=NRF_SUCCESS)
    {
        NRF_LOG_INFO("Reading threshold regiseter is failed");
        return;
    }
    if(p_reg_data->reg_addr==TCS34725_REG_THRESHOLD_LOW_L)
    {
        NRF_LOG_INFO("Threshold Low value : %d",p_reg_data->threshold_data);
    }
    else
    {
        NRF_LOG_INFO("Threshold High value : %d",p_reg_data->threshold_data);
    }
}

/**@brief Application main function.
 */
static void led_toggle_thread(void * pvParameter)
{
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);

    UNUSED_PARAMETER(pvParameter);
    while (true)
    {
        bsp_board_led_invert(BSP_BOARD_LED_0);
        vTaskDelay(1000);
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
//        printf("LED : %d\r\n",uxHighWaterMark2);
    }
}

static void tcs_read_rgbc_thread(void *arg)
{
    while(1)
    {
        tcs34725_read_rgbc(&tcs34725_instance,&tcs34725_rgbc_str,tcs34725_rgbc_cb);
        vTaskDelay(5000);
    }
}

static void ble_tcs_rgbc_send_thread(void *arg)
{
    ret_code_t err_code;
    char data_array[5+(3*4)]={NULL};
//    uint32_t *rgbc_addr=0;
    tcs34725_rgbc_data_t *rgbc_str;
    uint16_t length=sizeof(data_array);

    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);

    while(1)
    {
        if(ulTaskNotifyTake(pdTRUE,10)!=0)
        {

