lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
            sprintf(data_array,"%5d%3d%3d%3d",tcs34725_rgbc_str.clear,tcs34725_rgbc_str.red,tcs34725_rgbc_str.green,
                    tcs34725_rgbc_str.blue);
            if(m_conn_handle!=BLE_CONN_HANDLE_INVALID)
            {
                err_code=ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
//            uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
//            printf("BLE UART : %d\r\n",uxHighWaterMark2);
        }
    }
}


/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook( void )
{
#if NRF_LOG_ENABLED
     vTaskResume(m_logger_thread);
#endif
}

/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}

#if NRF_LOG_ENABLED
static void logger_thread(void * arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif

static void task_create_func(void)
{
    
    if(pdPASS!=xTaskCreate(tcs_read_rgbc_thread, "TCS_RGBC_READ", configMINIMAL_STACK_SIZE+60, 
                           NULL, 3, &m_tcs_read_rgbc_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    if(pdPASS!=xTaskCreate(ble_tcs_rgbc_send_thread, "TCS_RGBC_BLE_SEND", configMINIMAL_STACK_SIZE+60, 
                           NULL, 3, &m_ble_tcs_rgbc_send_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#if NRF_LOG_ENABLED
    if (pdPASS!=xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif
}


void tcs34725_start()
{
    ret_code_t err_code;

    err_code=tcs34725_init(&tcs34725_instance);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_timing(&tcs34725_instance, 150);  //1~256
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_wait_time(&tcs34725_instance, 255);   //1~256
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_persistence(&tcs34725_instance, TCS34725_OUT_OF_RANGE_3);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_gain(&tcs34725_instance, TCS34725_GAIN_x60);
    APP_ERROR_CHECK(err_code);

//    err_code=tcs34725_set_wait_long(&tcs34725_instance, TCS34725_WAIT_LONG_ENABLE);
//    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_threshold(&tcs34725_instance, TCS34725_THRESHOLD_LOW, 10000);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_threshold(&tcs34725_instance, TCS34725_THRESHOLD_HIGH, 65535);
    APP_ERROR_CHECK(err_code);
}

void tcs34725_read_config()
{
    ret_code_t err_code;

    tcs34725_read_all_config(&tcs34725_instance, tcs34725_read_reg_cb);

    err_code=tcs34725_read_threshold(&tcs34725_instance, TCS34725_THRESHOLD_LOW, tcs34725_read_thr_cb);
    APP_ERROR_CHECK(err_code);
    nrf_delay_ms(10);
    err_code=tcs34725_read_threshold(&tcs34725_instance, TCS34725_THRESHOLD_HIGH, tcs34725_read_thr_cb);
    APP_ERROR_CHECK(err_code);
}

int main(void)
{
    ret_code_t err_code;
    bool erase_bonds;
    // Initialize.
    uart_init();
    log_init();
    bsp_board_init(BSP_INIT_LEDS);
    clock_init();
    timers_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();

    twi_config();
    err_code=nrf_twi_sensor_init(&sensor_instance);
    APP_ERROR_CHECK(err_code);

    tcs34725_start();
    tcs34725_read_config();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    NRF_LOG_FLUSH();
    
    task_create_func();

    nrf_sdh_freertos_init(advertising_start,&erase_bonds);
    vTaskStartScheduler();

    // Enter main loop.
    for (;;)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
    }
}


/**
 * @}
 */
